# How do I read a tabular data file into pandas?
## Tabular - like table data

In [1]:
import pandas as pd

In [3]:
orders = pd.read_table('http://bit.ly/chiporders')
#            ^ assumes that a file is a tab separated one
orders.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [9]:
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']

movie_data = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=user_cols)

# sep='|' -> specifying a separator
# header=None -> saying that we don't have headers
# names=user_cols -> use the list items as the col names
######## Also some helpful args:
# skiprows -> Line numbers to skip (0-indexed) 
#             or number of lines to skip (int) at the start of the file.
#             We could also use lambdas
# skipfooter -> Number of lines at bottom of file to skip. Def: 0

movie_data.head(5)

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

## If we want to get some additional info about any methods, we click inside ()s and then press Shift+Tab